
&НаКлиенте
Процедура Удалить(Команда)
	Если ВыборКода = 0 Тогда
		Сообщить("Введите код");
	ИначеЕсли ВыборКода <> 0 Тогда
		Удаление(ВыборКода);
		Сообщить("Запись удалена, список обновится при повторном открытии");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция Удаление(Айди)
	Попытка
	ДокументУдаления = Документы.УдалениеДанных.СоздатьДокумент();
	ДокументУдаления.Дата = ТекущаяДата();
	ФИОГражданина = Справочники.ДанныеОГражданине.НайтиПоКоду(Айди).ФИО;
	ДокументУдаления.ИмяДокумента = "Гражданин " + ФИОГражданина;
	ДокументУдаления.Удалил = Логин;
	ДокументУдаления.Гражданин = ФИОГражданина;
	ДокументУдаления.Записать();
	Справочники.ДанныеОГражданине.НайтиПоКоду(Айди).ПолучитьОбъект().Удалить();
	Справочники.ДанныеОбАдресе.НайтиПоКоду(Айди).ПолучитьОбъект().Удалить();
	Справочники.ДанныеОНациональность.НайтиПоКоду(Айди).ПолучитьОбъект().Удалить();
	Справочники.ДанныеООбразовании.НайтиПоКоду(Айди).ПолучитьОбъект().Удалить();
	Справочники.ДанныеОРаботе.НайтиПоКоду(Айди).ПолучитьОбъект().Удалить();
	Справочники.ДанныеОСемье.НайтиПоКоду(Айди).ПолучитьОбъект().Удалить();
	Справочники.ДанныеОСтране.НайтиПоКоду(Айди).ПолучитьОбъект().Удалить();
	Справочники.ПерсональныеДанные.НайтиПоКоду(Айди).ПолучитьОбъект().Удалить();
	Справочники.СоциальныеДанные.НайтиПоКоду(Айди).ПолучитьОбъект().Удалить();
	Справочники.ВопросыДляГражданина.НайтиПоКоду(Айди).ПолучитьОбъект().Удалить();
Исключение
КонецПопытки;
КонецФункции

&НаКлиенте
Процедура Меню(Команда)
	Значение = ПроверкаМеню();
	ПараметрыЛогин = Новый Структура("Логин",Логин);
	Если Значение = 0 Тогда
		ОткрытьФорму("ОбщаяФорма.МенюСотрудника",ПараметрыЛогин);
		Закрыть(ЭтаФорма);
	Иначе
		ОткрытьФорму("ОбщаяФорма.МенюАдмина",ПараметрыЛогин);
		Закрыть(ЭтаФорма);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПроверкаМеню()
	Пользователь = Справочники.Сотрудник.НайтиПоНаименованию(Логин).Роль;
	Если Пользователь = Ложь Тогда
		Возврат 0;
	Иначе
		Возврат 1;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура Выход(Команда)
	Перем ЗакрытиеОкна;
	Попытка
	 ЗакрытиеОкон = ПолучитьОкна();
	Для Каждого Элемент Из ЗакрытиеОкон Цикл
    	Если Не Элемент.Основное Тогда
        	Форма = Элемент.ПолучитьСодержимое();
        	Форма.Закрыть();
    	КонецЕсли;
	КонецЦикла;
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнениеТаблицы();
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеТаблицы()
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеОГражданине.Код КАК Код,
	               |	ДанныеОГражданине.ФИО КАК ФИО,
	               |	ДанныеОГражданине.Код_СправочникаСотрудник КАК Код_СправочникаСотрудник,
	               |	ДанныеОГражданине.Код_СправочникАдрес КАК Код_СправочникАдрес,
	               |	ДанныеОГражданине.Код_СправочникаПерсональныеДанные КАК Код_СправочникаПерсональныеДанные,
	               |	ДанныеОГражданине.Код_СправочникаСоциальныеДанные КАК Код_СправочникаСоциальныеДанные,
	               |	ДанныеОГражданине.Код_СправочникаДанныеСемьи КАК Код_СправочникаДанныеСемьи,
	               |	ДанныеОГражданине.Код_СправочнниаДанныеОСтране КАК Код_СправочнниаДанныеОСтране,
	               |	ДанныеОГражданине.Код_СправочникаНациональности КАК Код_СправочникаНациональности,
	               |	ДанныеОГражданине.Код_СправочникаВопросы КАК Код_СправочникаВопросы
	               |ИЗ
	               |	Справочник.ДанныеОГражданине КАК ДанныеОГражданине";
	Результат = Запрос.Выполнить();
	Таблица = Результат.Выгрузить(ОбходРезультатаЗапроса.Прямой);
	ВывестиТаблицуЗначенияВКодеВТаблицуНаФорме(Таблица, "ДанныеГраждан", "Таблица1");
КонецПроцедуры

&НаСервере
Процедура ВывестиТаблицуЗначенияВКодеВТаблицуНаФорме(ТабВКоде, ТабРеквизит, ТабНаФорме) 
  НовыеРеквизиты = Новый Массив;
	Для Каждого Колонка Из ТабВКоде.Колонки Цикл
         НовыеРеквизиты.Добавить(
            Новый РеквизитФормы(
                Колонка.Имя, Колонка.ТипЗначения,
                ТабРеквизит));
    КонецЦикла;
    ИзменитьРеквизиты(НовыеРеквизиты);
    Для Каждого Колонка Из ТабВКоде.Колонки Цикл
        НовыйЭлемент = Элементы.Добавить(
            ТабРеквизит + "_" + Колонка.Имя, Тип("ПолеФормы"), Элементы[ТабНаФорме]);
        НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
        НовыйЭлемент.ПутьКДанным = ТабРеквизит + "." + Колонка.Имя;
    КонецЦикла;
    ЗначениеВРеквизитФормы(ТабВКоде, ТабРеквизит); 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем ФИОПользователя;
	ФИОСотрудник = Параметры.ФИО;
	Логин = Параметры.Логин;
КонецПроцедуры
