
&НаКлиенте
Процедура Удалить(Команда)	
	Тек = Элементы.Таблица1.ТекущиеДанные.Код;
	Удаление(Тек);
КонецПроцедуры

&НаСервере
Функция Удаление(Айди)
	Выделенные = Элементы.Таблица1.ВыделенныеСтроки;
	Выделенные.Удалить(Айди-1);
	ДанныеГраждан.Удалить(Айди-1);
	Справочники.ДанныеОГражданине.НайтиПоКоду(Айди).ПолучитьОбъект().Удалить();
	//Для Каждого ТекСтрока Из Выделенные Цикл
	//	Для Каждого Стр Из С
КонецФункции

&НаКлиенте
Процедура Меню(Команда)
	Закрыть(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Выход(Команда)
	Перем ЗакрытиеОкна;
	Попытка
	 ЗакрытиеОкон = ПолучитьОкна();
	Для Каждого Элемент Из ЗакрытиеОкон Цикл
    	Если Не Элемент.Основное Тогда
        	Форма = Элемент.ПолучитьСодержимое();
        	Форма.Закрыть();
    	КонецЕсли;
	КонецЦикла;
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнениеТаблицы();
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеТаблицы()
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеОГражданине.Код КАК Код,
	               |	ДанныеОГражданине.ФИО КАК ФИО,
	               |	ДанныеОГражданине.Код_СправочникаСотрудник КАК Код_СправочникаСотрудник,
	               |	ДанныеОГражданине.Код_СправочникАдрес КАК Код_СправочникАдрес,
	               |	ДанныеОГражданине.Код_СправочникаПерсональныеДанные КАК Код_СправочникаПерсональныеДанные,
	               |	ДанныеОГражданине.Код_СправочникаСоциальныеДанные КАК Код_СправочникаСоциальныеДанные,
	               |	ДанныеОГражданине.Код_СправочникаДанныеСемьи КАК Код_СправочникаДанныеСемьи,
	               |	ДанныеОГражданине.Код_СправочнниаДанныеОСтране КАК Код_СправочнниаДанныеОСтране,
	               |	ДанныеОГражданине.Код_СправочникаНациональности КАК Код_СправочникаНациональности,
	               |	ДанныеОГражданине.Код_СправочникаВопросы КАК Код_СправочникаВопросы
	               |ИЗ
	               |	Справочник.ДанныеОГражданине КАК ДанныеОГражданине";
	Результат = Запрос.Выполнить();
	Таблица = Результат.Выгрузить(ОбходРезультатаЗапроса.Прямой);
	ВывестиТаблицуЗначенияВКодеВТаблицуНаФорме(Таблица, "ДанныеГраждан", "Таблица1");
КонецПроцедуры

&НаСервере
Процедура ВывестиТаблицуЗначенияВКодеВТаблицуНаФорме(ТабВКоде, ТабРеквизит, ТабНаФорме) 
  НовыеРеквизиты = Новый Массив;
	Для Каждого Колонка Из ТабВКоде.Колонки Цикл
         НовыеРеквизиты.Добавить(
            Новый РеквизитФормы(
                Колонка.Имя, Колонка.ТипЗначения,
                ТабРеквизит));
    КонецЦикла;
    ИзменитьРеквизиты(НовыеРеквизиты);
    Для Каждого Колонка Из ТабВКоде.Колонки Цикл
        НовыйЭлемент = Элементы.Добавить(
            ТабРеквизит + "_" + Колонка.Имя, Тип("ПолеФормы"), Элементы[ТабНаФорме]);
        НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
        НовыйЭлемент.ПутьКДанным = ТабРеквизит + "." + Колонка.Имя;
    КонецЦикла;
    ЗначениеВРеквизитФормы(ТабВКоде, ТабРеквизит); 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем ФИОПользователя;
	ФИОСотрудник = Параметры.ФИО;
КонецПроцедуры
