
&НаКлиенте
Процедура Меню(Команда)
	Значение = ПроверкаМеню();
	ПараметрыЛогин = Новый Структура("Логин",Логин);
	Если Значение = 0 Тогда
		ОткрытьФорму("ОбщаяФорма.МенюСотрудника",ПараметрыЛогин);
		Закрыть(ЭтаФорма);
	Иначе
		ОткрытьФорму("ОбщаяФорма.МенюАдмина",ПараметрыЛогин);
		Закрыть(ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверкаМеню()
	Пользователь = Справочники.Сотрудник.НайтиПоНаименованию(Логин).Роль;
	Если Пользователь = Ложь Тогда
		Возврат 0;
	Иначе
		Возврат 1;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура Выход(Команда)
	Перем ЗакрытиеОкна;
	Попытка
	 ЗакрытиеОкон = ПолучитьОкна();
	Для Каждого Элемент Из ЗакрытиеОкон Цикл
    	Если Не Элемент.Основное Тогда
        	Форма = Элемент.ПолучитьСодержимое();
        	Форма.Закрыть();
    	КонецЕсли;
	КонецЦикла;
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайла(Команда)
	Перем Стр;
	Стр = "";
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл";
	Диалог.ПолноеИмяФайла = ""; 
	Фильтр = "TXT (*.txt)|*.txt"; 
	Диалог.Фильтр = Фильтр; 
    Диалог.МножественныйВыбор = Ложь;
	Диалог.Каталог = "C:\Users\Public\Documents";
	Если Диалог.Выбрать() Тогда
		ПутьФайла = Диалог.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ФИОСотрудника = Параметры.ФИО;
	Логин = Параметры.Логин;
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	Перем Счетчик;
	Счетчик = РазмерСправочника() + 1;
	Загрузка(Счетчик);
КонецПроцедуры

&НаСервере
Процедура Загрузка(Счетчик)
	Перем Стр;
	Стр = "";
	МассивСтрок = Новый Массив;
	ВыбранныйФайл = Новый Файл(ПутьФайла);
	Если ВыбранныйФайл.Существует() Тогда
		Текст = Новый ЧтениеТекста(ВыбранныйФайл.ПолноеИмя,КодировкаТекста.ANSI,Символы.ВК + Символы.ПС, Символы.ПС);
		Стр = Текст.ПрочитатьСтроку();
		Пока Стр <> Неопределено Цикл
			МассивСтрок.Добавить(Стр);
			Стр = Текст.ПрочитатьСтроку();
		КонецЦикла;
		Для Каждого ЭлементМассива Из МассивСтрок Цикл
			КоличествоСтрок = КоличествоСтрок + 1;
			СправочникГражданин = Справочники.ДанныеОГражданине.СоздатьЭлемент();
			СправочникПерсДанные = Справочники.ПерсональныеДанные.СоздатьЭлемент();
			СправочникСоцДанные = Справочники.СоциальныеДанные.СоздатьЭлемент();
			СправочникОбразование = Справочники.ДанныеООбразовании.СоздатьЭлемент();
			СправочникРабота = Справочники.ДанныеОРаботе.СоздатьЭлемент();
			СправочникМиграции = Справочники.ДанныеОСтране.СоздатьЭлемент();
			СправочникСемья = Справочники.ДанныеОСемье.СоздатьЭлемент();
			СправочникНациональность = Справочники.ДанныеОНациональность.СоздатьЭлемент();
			СправочникАдрес = Справочники.ДанныеОбАдресе.СоздатьЭлемент();
			СправочникВопросы = Справочники.ВопросыДляГражданина.СоздатьЭлемент();
			МассивРазбитойСтроки = Новый Массив;
			РазбитаяСтрока = СтрРазделить(ЭлементМассива,",");
			Для Каждого ЧастьСтроки Из РазбитаяСтрока Цикл
				МассивРазбитойСтроки.Добавить(ЧастьСтроки);
			КонецЦикла;
			ФИОГражданина = МассивРазбитойСтроки[0];
			СправочникГражданин.ФИО = ФИОГражданина;
			СправочникСоцДанные.Наименование = "Данные " + ФИОГражданина;
			СправочникГражданин.Наименование = "Гражданин " + ФИОГражданина;
			СправочникПерсДанные.Наименование = "Данные " + ФИОГражданина;
			СправочникОбразование.Наименование = "Данные " + ФИОГражданина;
			СправочникРабота.Наименование = "Данные " + ФИОГражданина;
			СправочникМиграции.Наименование = "Данные " + ФИОГражданина;
			СправочникСемья.Наименование = "Данные " + ФИОГражданина;
			СправочникНациональность.Наименование = "Данные " + ФИОГражданина;
			СправочникАдрес.Наименование = "Адрес " + ФИОГражданина;
			СправочникВопросы.Наименование = "Данные " + ФИОГражданина;
			СправочникГражданин.Код = Счетчик;
			СправочникАдрес.Код = Счетчик;
			СправочникВопросы.Код = Счетчик;
			СправочникМиграции.Код = Счетчик;
			СправочникНациональность.Код = Счетчик;
			СправочникОбразование.Код = Счетчик;
			СправочникПерсДанные.Код = Счетчик;
			СправочникРабота.Код = Счетчик;
			СправочникСемья.Код = Счетчик;
			СправочникСоцДанные.Код = Счетчик;
			СправочникПерсДанные.Пол = МассивРазбитойСтроки[1];
			СправочникПерсДанные.Возраст = МассивРазбитойСтроки[2];
			СправочникСоцДанные.СоциальныйСтатус = МассивРазбитойСтроки[7];
			СправочникОбразование.УровеньГрамотности = МассивРазбитойСтроки[8];
			СправочникОбразование.УровеньОбразования = МассивРазбитойСтроки[9];
			СправочникОбразование.ОбразовательныеУчреждения = МассивРазбитойСтроки[10];
			СправочникРабота.СтатусЭкономическойАктичности = МассивРазбитойСтроки[11];
			СправочникРабота.РодЗанятий = МассивРазбитойСтроки[12];
			СправочникРабота.Работа = МассивРазбитойСтроки[13];
			СправочникРабота.СтатусВозможнойРаботоспособности = МассивРазбитойСтроки[14];
			СправочникМиграции.СтранаРождения = МассивРазбитойСтроки[15];
			СправочникМиграции.ДатаМиграции = МассивРазбитойСтроки[16];
			СправочникМиграции.Гражданство = МассивРазбитойСтроки[17];
			СправочникСемья.ЧленСемьи = МассивРазбитойСтроки[18];
			СправочникСемья.СтатусЧленаСемьи = МассивРазбитойСтроки[19];
			СправочникСемья.Отношение = МассивРазбитойСтроки[20];
			СправочникСемья.СтепеньРодства = МассивРазбитойСтроки[21];
			СправочникНациональность.Национальность = МассивРазбитойСтроки[22];
			СправочникНациональность.ПервыйЯзык = МассивРазбитойСтроки[23];
			СправочникНациональность.Религия = МассивРазбитойСтроки[24];
			СправочникНациональность.ДругиеЯзыки = МассивРазбитойСтроки[25];
			СправочникАдрес.Область = МассивРазбитойСтроки[26];
			СправочникАдрес.Регион = МассивРазбитойСтроки[27];
			СправочникАдрес.НаселенныйПункт = МассивРазбитойСтроки[28];
			СправочникАдрес.Улица = МассивРазбитойСтроки[29];
			СправочникАдрес.Дом = МассивРазбитойСтроки[30];
			СправочникАдрес.Строение = МассивРазбитойСтроки[31];
			СправочникВопросы.Вопросы = МассивРазбитойСтроки[32];
			СправочникВопросы.Ответы = МассивРазбитойСтроки[33];
			СправочникАдрес.Записать();
			СправочникВопросы.Записать();	
			СправочникМиграции.Записать();
			СправочникНациональность.Записать();
			СправочникОбразование.Записать();
			СправочникПерсДанные.Записать();
			СправочникРабота.Записать();
			СправочникСемья.Записать();
			СправочникСоцДанные.Записать();
			СправочникГражданин.Код_СправочникАдрес = Справочники.ДанныеОбАдресе.НайтиПоКоду(Счетчик).Ссылка;
			СправочникГражданин.Код_СправочникаПерсональныеДанные = Справочники.ПерсональныеДанные.НайтиПоКоду(Счетчик).Ссылка;
			СправочникГражданин.Код_СправочникаСоциальныеДанные = Справочники.СоциальныеДанные.НайтиПоКоду(Счетчик).Ссылка;
			СправочникГражданин.Код_СправочникаДанныеСемьи = Справочники.ДанныеОСемье.НайтиПоКоду(Счетчик).Ссылка;
			СправочникГражданин.Код_СправочнниаДанныеОСтране = Справочники.ДанныеОСтране.НайтиПоКоду(Счетчик).Ссылка;
			СправочникГражданин.Код_СправочникаНациональности = Справочники.ДанныеОНациональность.НайтиПоКоду(Счетчик).Ссылка;
			СправочникГражданин.Код_СправочникаВопросы = Справочники.ВопросыДляГражданина.НайтиПоКоду(Счетчик).Ссылка;
			СправочникГражданин.Записать();
			СтатусЗагрузки = "Загрузка завершена! Количество введенных строк: " + КоличествоСтрок;
			Счетчик = Счетчик + 1;
		КонецЦикла;
	Иначе
		Сообщить("Файл не найден!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция РазмерСправочника()
	КоличествоЗаписей = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
               |	Справочник.Ссылка КАК Ссылка,
               |	МАКСИМУМ(Справочник.Код) КАК Код
               |ИЗ
               |	Справочник.ДанныеОГражданине КАК Справочник
               |
               |СГРУППИРОВАТЬ ПО
               |	Справочник.Ссылка";
Выборка = Запрос.Выполнить().Выбрать();
Выборка.Следующий();
Если Выборка.Код = Неопределено Тогда
	МаксимумКод = 0;
	Возврат МаксимумКод;
Иначе
	МаксимумКод = Выборка.Код;
	Возврат МаксимумКод;
КонецЕсли;
 КонецФункции

