
&НаКлиенте	
Процедура Сохранить(Команда)
	Перем Счетчик;
	Счетчик = РазмерСправочника() + 1;
	Сообщить(Счетчик);
	СоздатьЗапись(Счетчик);
	Значение = ПроверкаМеню();
	ПараметрыЛогин = Новый Структура("Логин",Логин);
	Если Логин <> "" Тогда
	Если Значение = 0 Тогда
		ОткрытьФорму("ОбщаяФорма.МенюСотрудника",ПараметрыЛогин);
		Закрыть(ЭтаФорма);
	Иначе
		ОткрытьФорму("ОбщаяФорма.МенюАдмина",ПараметрыЛогин);
		Закрыть(ЭтаФорма);
	КонецЕсли;
Иначе
	Закрыть(ЭтаФорма);
	КонецЕсли;
КонецПроцедуры 


&НаСервере
Функция СоздатьЗапись(ЧислоЗаписей)
	Перем АдресСправочник,ВопросыСправочник,ПерсональныеДанныеСправочник,
	СемьяСправочник,СтранаСправочник,РаботаСправочник,ОбразованиеСправочник,
	СоциальныеДанныеСправочник,ГражданинСправочник,ЛогинДляДокумента;
	АдресСправочник = Справочники.ДанныеОбАдресе.СоздатьЭлемент();
	АдресСправочник.Код = ЧислоЗаписей;
	АдресСправочник.Наименование = "Адрес " + ФИО;
	АдресСправочник.Область = Область;
	АдресСправочник.Регион = Регион;
	АдресСправочник.Улица = Улица;
	АдресСправочник.Дом = Дом;
	АдресСправочник.Строение = Строение;
	АдресСправочник.Записать();
	ВопросыСправочник = Справочники.ВопросыДляГражданина.СоздатьЭлемент();
	ВопросыСправочник.Код = ЧислоЗаписей;
	ВопросыСправочник.Наименование =  "Данные " + ФИО;
	ВопросыСправочник.Вопросы = Вопросы;
	ВопросыСправочник.Ответы = Ответы;
	ВопросыСправочник.Записать();
	ПерсональныеДанныеСправочник = Справочники.ПерсональныеДанные.СоздатьЭлемент();
	ПерсональныеДанныеСправочник.Код = ЧислоЗаписей;
	ПерсональныеДанныеСправочник.Наименование = "Данные " + ФИО;
	ПерсональныеДанныеСправочник.Пол = Пол;
	ПерсональныеДанныеСправочник.Возраст = Возраст;
	ПерсональныеДанныеСправочник.БрачныйСтатус = БрачныйСтатус;
	ПерсональныеДанныеСправочник.Записать();
	НациональностьСправочник = Справочники.ДанныеОНациональность.СоздатьЭлемент();
	НациональностьСправочник.Код = ЧислоЗаписей+1;
	НациональностьСправочник.Наименование = "Данные " + ФИО;
	НациональностьСправочник.Национальность = Национальность;
	НациональностьСправочник.ПервыйЯзык = ПервыйЯзык;
	НациональностьСправочник.Религия = Религия;
	НациональностьСправочник.ДругиеЯзыки = ДругиеЯзыки;
	НациональностьСправочник.Записать();
	СемьяСправочник = Справочники.ДанныеОСемье.СоздатьЭлемент();
	СемьяСправочник.Код = ЧислоЗаписей;
	СемьяСправочник.Наименование = "Данные " + ФИО;
	СемьяСправочник.ЧленСемьи = ЧленСемьи;
	СемьяСправочник.СтатусЧленаСемьи = СтатусЧленаСемьи;
	СемьяСправочник.Отношение = Отношение;
	СемьяСправочник.СтепеньРодства = СтепеньРодства;
	СемьяСправочник.Записать();
	СтранаСправочник = Справочники.ДанныеОСтране.СоздатьЭлемент();
	СтранаСправочник.Код = ЧислоЗаписей;
	СтранаСправочник.Наименование = "Данные " + ФИО;
	СтранаСправочник.СтранаРождения = СтранаРождения;
	СтранаСправочник.ДатаМиграции = ДатаМиграции;
	СтранаСправочник.Гражданство = Гражданство;
	СтранаСправочник.Записать();
	РаботаСправочник = Справочники.ДанныеОРаботе.СоздатьЭлемент();
	РаботаСправочник.Код = ЧислоЗаписей;
	РаботаСправочник.Наименование = "Данные " + ФИО;
	РаботаСправочник.СтатусЭкономическойАктичности = СтатусЭкономическойАктивности;
	РаботаСправочник.РодЗанятий = РодЗанятий;
	РаботаСправочник.Работа = Работа;
	РаботаСправочник.СтатусВозможнойРаботоспособности = СтатусВозможнойРаботоспособности;
	РаботаСправочник.Записать();
	ОбразованиеСправочник = Справочники.ДанныеООбразовании.СоздатьЭлемент();
	ОбразованиеСправочник.Код = ЧислоЗаписей;
	ОбразованиеСправочник.Наименование = "Данные " + ФИО;
	ОбразованиеСправочник.УровеньГрамотности = УровеньГрамотности;
	ОбразованиеСправочник.УровеньОбразования = УровеньОбразования;
	ОбразованиеСправочник.ОбразовательныеУчреждения = ОбразовательныеУчреждения;
	ОбразованиеСправочник.Записать();
	СоциальныеДанныеСправочник = Справочники.СоциальныеДанные.СоздатьЭлемент();
	СоциальныеДанныеСправочник.Код = ЧислоЗаписей;
	СоциальныеДанныеСправочник.Наименование = "Данные " + ФИО;
	СоциальныеДанныеСправочник.СоциальныйСтатус = СоциальныйСтатус;
	СоциальныеДанныеСправочник.Код_СправочникаОбразование = Справочники.ДанныеООбразовании.НайтиПоКоду(ЧислоЗаписей).Ссылка;
	СоциальныеДанныеСправочник.Код_СправочникаРабота = Справочники.ДанныеОРаботе.НайтиПоКоду(ЧислоЗаписей).Ссылка;
	СоциальныеДанныеСправочник.Записать();
	ГражданинСправочник = Справочники.ДанныеОГражданине.СоздатьЭлемент();
	ГражданинСправочник.Код = ЧислоЗаписей;
	ГражданинСправочник.Наименование = "Данные " + ФИО;
	ГражданинСправочник.ФИО = ФИО;
	ГражданинСправочник.Код_СправочникАдрес = Справочники.ДанныеОбАдресе.НайтиПоКоду(ЧислоЗаписей).Ссылка;
	ГражданинСправочник.Код_СправочникаПерсональныеДанные = Справочники.ПерсональныеДанные.НайтиПоКоду(ЧислоЗаписей).Ссылка;
	ГражданинСправочник.Код_СправочникаСоциальныеДанные = Справочники.СоциальныеДанные.НайтиПоКоду(ЧислоЗаписей).Ссылка;
	ГражданинСправочник.Код_СправочникаДанныеСемьи = Справочники.ДанныеОСемье.НайтиПоКоду(ЧислоЗаписей).Ссылка;
	ГражданинСправочник.Код_СправочнниаДанныеОСтране = Справочники.ДанныеОСтране.НайтиПоКоду(ЧислоЗаписей).Ссылка;
	ГражданинСправочник.Код_СправочникаНациональности = Справочники.ДанныеОНациональность.НайтиПоКоду(ЧислоЗаписей).Ссылка;
	ГражданинСправочник.Код_СправочникаВопросы = Справочники.ВопросыДляГражданина.НайтиПоКоду(ЧислоЗаписей).Ссылка;
	ГражданинСправочник.Записать();
	ДобавлениеДокумент = Документы.ДобавлениеДанныхГражданином.СоздатьДокумент();
	ДобавлениеДокумент.Дата = ТекущаяДата();
	ДобавлениеДокумент.ИмяДокумента = "Добавление записи о " + ФИО;
	ЛогинДляДокумента = Логин;                            
	Если ЛогинДляДокумента = "" Тогда
		ДобавлениеДокумент.Добавил = "Гражданин";
	Иначе
		ДобавлениеДокумент.Добавил = ЛогинДляДокумента;
	КонецЕсли;
	ДобавлениеДокумент.СсылкаНаГражданина = Справочники.ДанныеОГражданине.НайтиПоКоду(ЧислоЗаписей).Ссылка;
	ДобавлениеДокумент.Записать();
КонецФункции


&НаСервере
Функция РазмерСправочника()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(isnull(Справочник.Код,0)) КАК Код1
	               |ИЗ
	               |	Справочник.ДанныеОГражданине КАК Справочник";
Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();
Если Выборка.Следующий() Тогда
	МаксимумКод = Выборка.Код1;
	Возврат МаксимумКод;
КонецЕсли;
 КонецФункции

&НаСервере
 Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 Логин = Параметры.Логин;
 КонецПроцедуры

&НаКлиенте
 Процедура Меню(Команда)
	Значение = ПроверкаМеню();
	ПараметрыЛогин = Новый Структура("Логин",Логин);
	Если Логин <> "" Тогда
	Если Значение = 0 Тогда
		ОткрытьФорму("ОбщаяФорма.МенюСотрудника",ПараметрыЛогин);
		Закрыть(ЭтаФорма);
	Иначе
		ОткрытьФорму("ОбщаяФорма.МенюАдмина",ПараметрыЛогин);
		Закрыть(ЭтаФорма);
	КонецЕсли;
Иначе
	Закрыть(ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверкаМеню()
	Пользователь = Справочники.Сотрудник.НайтиПоНаименованию(Логин).Роль;
	Если Пользователь = Ложь Тогда
		Возврат 0;
	Иначе
		Возврат 1;
	КонецЕсли;
КонецФункции
