
&НаКлиенте
Процедура Меню(Команда)
	Значение = ПроверкаМеню();
	ПараметрыЛогин = Новый Структура("Логин",Логин);
	Если Значение = 0 Тогда
		ОткрытьФорму("ОбщаяФорма.МенюСотрудника",ПараметрыЛогин);
		Закрыть(ЭтаФорма);
	Иначе
		ОткрытьФорму("ОбщаяФорма.МенюАдмина",ПараметрыЛогин);
		Закрыть(ЭтаФорма);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПроверкаМеню()
	Пользователь = Справочники.Сотрудник.НайтиПоНаименованию(Логин).Роль;
	Если Пользователь = Ложь Тогда
		Возврат 0;
	Иначе
		Возврат 1;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ФИОСотрудника = Параметры.ФИО;
	Логин = Параметры.Логин;
	Для Каждого Справочник Из Метаданные.Справочники Цикл
	Элементы.ПолеВыборТаблиц.СписокВыбора.Добавить(Справочник.ПолноеИмя());
	КонецЦикла;
	Фильтр = Элементы.ПолеВыборТаблиц.СписокВыбора[0].Значение;
КонецПроцедуры

&НаКлиенте
Процедура Выход(Команда)
	Перем ЗакрытиеОкна;
	Попытка
	 ЗакрытиеОкон = ПолучитьОкна();
	Для Каждого Элемент Из ЗакрытиеОкон Цикл
    	Если Не Элемент.Основное Тогда
        	Форма = Элемент.ПолучитьСодержимое();
        	Форма.Закрыть();
    	КонецЕсли;
	КонецЦикла;
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ПоискНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |  *
				   |ИЗ
	               |	" + Фильтр + " КАК " + СтрЗаменить(Фильтр,"Справочник.","");
	Результат = Запрос.Выполнить().Выгрузить();
	ТаблицаЗначений.Загрузить(Результат);
	ВывестиТаблицуЗначенияВКодеВТаблицуНаФорме(Результат, "ТаблицаЗначений", "Таблица1");
	ДокументПоискаДругихДанных = Документы.ВыводДругихДанных.СоздатьДокумент();
	ДокументПоискаДругихДанных.Дата = ТекущаяДата();
	ДокументПоискаДругихДанных.ИмяДокумента = "Искал данные по " + Фильтр;
	ДокументПоискаДругихДанных.Искал = Логин;
	ДокументПоискаДругихДанных.ФильтрПоиска = Фильтр;
	ДокументПоискаДругихДанных.Записать();
КонецПроцедуры

&НаКлиенте
Процедура Поиск(Команда)
	Если Фильтр = "" Тогда
		Сообщить("Выберете	фильтр");
	Иначе
		ПоискНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВывестиТаблицуЗначенияВКодеВТаблицуНаФорме(ТабВКоде, ТабРеквизит, ТабНаФорме)
	Попытка
	НовыеРеквизиты = Новый Массив;
	Для Каждого Колонка Из ТабВКоде.Колонки Цикл
         НовыеРеквизиты.Добавить(
            Новый РеквизитФормы(
                Колонка.Имя, Колонка.ТипЗначения,
                ТабРеквизит));
    КонецЦикла;
    ИзменитьРеквизиты(НовыеРеквизиты);
    Для Каждого Колонка Из ТабВКоде.Колонки Цикл
        НовыйЭлемент = Элементы.Добавить(
            ТабРеквизит + "_" + Колонка.Имя, Тип("ПолеФормы"), Элементы[ТабНаФорме]);
        НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
        НовыйЭлемент.ПутьКДанным = ТабРеквизит + "." + Колонка.Имя;
    КонецЦикла;
    ЗначениеВРеквизитФормы(ТабВКоде, ТабРеквизит);
Исключение
	КонецПопытки;
КонецПроцедуры

