&НаКлиенте
Процедура Меню(Команда)
	Значение = ПроверкаМеню();
	ПараметрыЛогин = Новый Структура("Логин",Логин);
	Если Значение = 0 Тогда
		ОткрытьФорму("ОбщаяФорма.МенюСотрудника",ПараметрыЛогин);
		Закрыть(ЭтаФорма);
	Иначе
		ОткрытьФорму("ОбщаяФорма.МенюАдмина",ПараметрыЛогин);
		Закрыть(ЭтаФорма);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПроверкаМеню()
	Пользователь = Справочники.Сотрудник.НайтиПоНаименованию(Логин).Роль;
	Если Пользователь = Ложь Тогда
		Возврат 0;
	Иначе
		Возврат 1;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЛогинАвторизованный = Параметры.Логин;
	ЗаголовокНаСтранице = "Создание учетной записи сотрудника"; 
КонецПроцедуры

&НаСервере
Процедура СоздатьНаСервере()
	Пользователь = Справочники.Сотрудник.НайтиПоНаименованию(Логин);
	ВыборкаЛогина = Пользователь.Логин;
	ВыборкаПароль = Пользователь.Пароль;
	ВыборкаРоли = Пользователь.Роль;
	Массив = Новый Массив;
	Массив.Вставить(0,ВыборкаЛогина);
	Массив.Вставить(1,ВыборкаПароль);
	Массив.Вставить(2,ВыборкаРоли);
	Если Логин = Массив[0] И Пароль = Массив[1] Тогда
		Сообщить("Запись сотрудника уже существует");
	Иначе
		ЗаписьСотрудник = Справочники.Сотрудник.СоздатьЭлемент();
		ЗаписьСотрудник.Наименование = Логин;
		ЗаписьСотрудник.Логин = Логин;
		ЗаписьСотрудник.Пароль = Пароль;
		ЗаписьСотрудник.Роль = Роль;
		ЗаписьСотрудник.Записать();
		ДокументСозданияСотрудник = Документы.СозданиеСотрудника.СоздатьДокумент();
		ДокументСозданияСотрудник.Дата = ТекущаяДата();
		ДокументСозданияСотрудник.ИмяДокумента = "Создание запись " + Логин;
		ДокументСозданияСотрудник.Создал = ЛогинАвторизованный;
		ДокументСозданияСотрудник.ЛогинНовогоСотрудника = Логин;
		ДокументСозданияСотрудник.Записать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	Если Логин = "" И Пароль = "" Тогда
		Сообщить("Заполните логин и пароль");
	ИначеЕсли Логин <> "" И Пароль <> "" Тогда
		СоздатьНаСервере();
	КонецЕсли;
КонецПроцедуры
