
&НаКлиенте
Процедура Авторизация(Команда)
	МассивПользователя = Новый Массив;
	МассивПользователя = ВыборкаПользователей();
	Параметр = Новый Структура("Логин",Логин);
	Если Логин = МассивПользователя[0] И Пароль = МассивПользователя[1] Тогда
		Если МассивПользователя[2] = Истина Тогда
			ОткрытьФорму("ОбщаяФорма.МенюАдмина",Параметр);
		ИначеЕсли МассивПользователя[2] = Ложь Тогда
			ОткрытьФорму("ОбщаяФорма.МенюСотрудника",Параметр);
		КонецЕсли;
	КонецЕсли;
	Логин = "";
	Пароль = "";
КонецПроцедуры

&НаСервере
Функция ВыборкаПользователей()
Пользователь = Справочники.Сотрудник.НайтиПоНаименованию(Логин);
	ВыборкаЛогина = Пользователь.Логин;
	ВыборкаПароль = Пользователь.Пароль;
	ВыборкаРоли = Пользователь.Роль;
	Массив = Новый Массив;
	Массив.Вставить(0,ВыборкаЛогина);
	Массив.Вставить(1,ВыборкаПароль);
	Массив.Вставить(2,ВыборкаРоли);
	Возврат Массив; 	
КонецФункции

&НаКлиенте
Процедура ВводДанных(Команда)
	Параметр1 = Новый Структура("Логин",Логин);
	ОткрытьФорму("Документ.ДобавлениеДанныхГражданином.Форма.ФормаДобавленияДанныхГражданином",Параметр1);
КонецПроцедуры
