
&НаКлиенте	
Процедура Сохранить(Команда)
	Перем Счетчик;
	Счетчик = РазмерСправочника() + 1;
	СоздатьЗапись(Счетчик);	
КонецПроцедуры 


&НаСервере
Функция СоздатьЗапись(ЧислоЗаписей)
	Перем АдресСправочник,ВопросыСправочник,ПерсональныеДанныеСправочник,
	СемьяСправочник,СтранаСправочник,РаботаСправочник,ОбразованиеСправочник,СоциальныеДанныеСправочник,ГражданинСправочник;
	АдресСправочник = Справочники.ДанныеОбАдресе.СоздатьЭлемент();
	АдресСправочник.Код = ЧислоЗаписей;
	АдресСправочник.Наименование = "Адрес Гражданина " + ЧислоЗаписей;
	АдресСправочник.Область = Область;
	АдресСправочник.Регион = Регион;
	АдресСправочник.Улица = Улица;
	АдресСправочник.Дом = Дом;
	АдресСправочник.Строение = Строение;
	АдресСправочник.Записать();
	ВопросыСправочник = Справочники.Вопросы.СоздатьЭлемент();
	ВопросыСправочник.Код = ЧислоЗаписей;
	ВопросыСправочник.Наименование =  "Вопросы " + ЧислоЗаписей;
	ВопросыСправочник.Вопросы = Вопросы;
	ВопросыСправочник.Ответы = Ответы;
	ВопросыСправочник.Записать();
	ПерсональныеДанныеСправочник = Справочники.ПерсональныеДанные.СоздатьЭлемент();
	ПерсональныеДанныеСправочник.Код = ЧислоЗаписей;
	ПерсональныеДанныеСправочник.Наименование = "Гражданин" + ЧислоЗаписей;
	ПерсональныеДанныеСправочник.Пол = Пол;
	ПерсональныеДанныеСправочник.Возраст = Возраст;
	ПерсональныеДанныеСправочник.БрачныйСтатус = БрачныйСтатус;
	ПерсональныеДанныеСправочник.Записать();
	НациональностьСправочник = Справочники.ДанныеОНациональность.СоздатьЭлемент();
	НациональностьСправочник.Код = ЧислоЗаписей;
	НациональностьСправочник.Наименование = "Гражданин " + ЧислоЗаписей;
	НациональностьСправочник.Национальность = Национальность;
	НациональностьСправочник.ПервыйЯзык = ПервыйЯзык;
	НациональностьСправочник.Религия = Религия;
	НациональностьСправочник.ДругиеЯзыки = ДругиеЯзыки;
	НациональностьСправочник.Записать();
	СемьяСправочник = Справочники.ДанныеОСемье.СоздатьЭлемент();
	СемьяСправочник.Код = ЧислоЗаписей;
	СемьяСправочник.Наименование = "Гражданин " + ЧислоЗаписей;
	СемьяСправочник.ЧленСемьи = ЧленСемьи;
	СемьяСправочник.СтатусЧленаСемьи = СтатусЧленаСемьи;
	СемьяСправочник.Отношение = Отношение;
	СемьяСправочник.СтепеньРодства = СтепеньРодства;
	СемьяСправочник.Записать();
	СтранаСправочник = Справочники.ДанныеОСтране.СоздатьЭлемент();
	СтранаСправочник.Код = ЧислоЗаписей;
	СтранаСправочник.Наименование = "Гражданин " + ЧислоЗаписей;
	СтранаСправочник.СтранаРождения = СтранаРождения;
	СтранаСправочник.ДатаМиграции = ДатаМиграции;
	СтранаСправочник.Гражданство = Гражданство;
	СтранаСправочник.Записать();
	РаботаСправочник = Справочники.ДанныеОРаботе.СоздатьЭлемент();
	РаботаСправочник.Код = ЧислоЗаписей;
	РаботаСправочник.Наименование = "Гражданин " + ЧислоЗаписей;
	РаботаСправочник.СтатусЭкономическойАктичности = СтатусЭкономическойАктивности;
	РаботаСправочник.РодЗанятий = РодЗанятий;
	РаботаСправочник.Работа = Работа;
	РаботаСправочник.СтатусВозможнойРаботоспособности = СтатусВозможнойРаботоспособности;
	РаботаСправочник.Записать();
	ОбразованиеСправочник = Справочники.ДанныеООбразовании.СоздатьЭлемент();
	ОбразованиеСправочник.Код = ЧислоЗаписей;
	ОбразованиеСправочник.Наименование = "Гражданин " + ЧислоЗаписей;
	ОбразованиеСправочник.УровеньГрамотности = УровеньГрамотности;
	ОбразованиеСправочник.УровеньОбразования = УровеньОбразования;
	ОбразованиеСправочник.ОбразовательныеУчреждения = ОбразовательныеУчреждения;
	ОбразованиеСправочник.Записать();
	СоциальныеДанныеСправочник = Справочники.СоциальныеДанные.СоздатьЭлемент();
	СоциальныеДанныеСправочник.Код = ЧислоЗаписей;
	СоциальныеДанныеСправочник.Наименование = "Гражданин " + ЧислоЗаписей;
	СоциальныеДанныеСправочник.СоциальныйСтатус = СоциальныйСтатус;
	СоциальныеДанныеСправочник.Код_СправочникаОбразование = Справочники.ДанныеООбразовании.НайтиПоКоду(ЧислоЗаписей).Ссылка;
	СоциальныеДанныеСправочник.Код_СправочникаРабота = Справочники.ДанныеОРаботе.НайтиПоКоду(ЧислоЗаписей).Ссылка;
	СоциальныеДанныеСправочник.Записать();
	ГражданинСправочник = Справочники.ДанныеОГражданине.СоздатьЭлемент();
	ГражданинСправочник.Код = ЧислоЗаписей;
	ГражданинСправочник.Наименование = "Гражданин " + ЧислоЗаписей;
	ГражданинСправочник.ФИО = ФИО;
	ГражданинСправочник.Код_СправочникАдрес = Справочники.ДанныеОбАдресе.НайтиПоКоду(ЧислоЗаписей).Ссылка;
	ГражданинСправочник.Код_СправочникаПерсональныеДанные = Справочники.ПерсональныеДанные.НайтиПоКоду(ЧислоЗаписей).Ссылка;
	ГражданинСправочник.Код_СправочникаСоциальныеДанные = Справочники.СоциальныеДанные.НайтиПоКоду(ЧислоЗаписей).Ссылка;
	ГражданинСправочник.Код_СправочникаДанныеСемьи = Справочники.ДанныеОСемье.НайтиПоКоду(ЧислоЗаписей).Ссылка;
	ГражданинСправочник.Код_СправочнниаДанныеОСтране = Справочники.ДанныеОСтране.НайтиПоКоду(ЧислоЗаписей).Ссылка;
	ГражданинСправочник.Код_СправочникаНациональности = Справочники.ДанныеОНациональность.НайтиПоКоду(ЧислоЗаписей).Ссылка;
	ГражданинСправочник.Код_СправочникаВопросы = Справочники.Вопросы.НайтиПоКоду(ЧислоЗаписей).Ссылка;
	ГражданинСправочник.Записать();
КонецФункции


&НаСервере
Функция РазмерСправочника()
ИмяСправочника = Метаданные.Справочники.ДанныеОГражданине.Имя;
ТекстЗапроса = "ВЫБРАТЬ
| Количество(Справочник.Ссылка) КАК Всего
| ИЗ
| Справочник." + ИмяСправочника + " КАК Справочник";
ЗапросКоличества = Новый Запрос(ТекстЗапроса);
Результат = ЗапросКоличества.Выполнить().Выбрать();
Результат.Следующий();
КоличествоЗаписей = Результат.Всего;
Возврат КоличествоЗаписей;
 КонецФункции
